; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph2 - mode
	infrared1 - mode
	image3 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image3)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 172)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 107)
	(= (data Phenomenon5 thermograph2) 193)
	(= (data Phenomenon6 thermograph2) 139)
	(= (data Star7 thermograph2) 292)
	(= (data Star8 thermograph2) 9)
	(= (data Phenomenon5 infrared1) 266)
	(= (data Phenomenon6 infrared1) 164)
	(= (data Star7 infrared1) 117)
	(= (data Star8 infrared1) 276)
	(= (data Phenomenon5 image3) 273)
	(= (data Phenomenon6 image3) 57)
	(= (data Star7 image3) 7)
	(= (data Star8 image3) 250)
	(= (data Phenomenon5 infrared0) 246)
	(= (data Phenomenon6 infrared0) 100)
	(= (data Star7 infrared0) 269)
	(= (data Star8 infrared0) 221)
	(= (slew_time GroundStation4 Star0) 61.94)
	(= (slew_time Star0 GroundStation4) 61.94)
	(= (slew_time GroundStation4 GroundStation1) 22)
	(= (slew_time GroundStation1 GroundStation4) 22)
	(= (slew_time GroundStation4 GroundStation2) 51.5)
	(= (slew_time GroundStation2 GroundStation4) 51.5)
	(= (slew_time GroundStation4 GroundStation3) 51.23)
	(= (slew_time GroundStation3 GroundStation4) 51.23)
	(= (slew_time GroundStation2 Star0) 48.93)
	(= (slew_time Star0 GroundStation2) 48.93)
	(= (slew_time GroundStation2 GroundStation1) 18.15)
	(= (slew_time GroundStation1 GroundStation2) 18.15)
	(= (slew_time GroundStation1 Star0) 23.56)
	(= (slew_time Star0 GroundStation1) 23.56)
	(= (slew_time GroundStation3 Star0) 45.31)
	(= (slew_time Star0 GroundStation3) 45.31)
	(= (slew_time GroundStation3 GroundStation1) 54.62)
	(= (slew_time GroundStation1 GroundStation3) 54.62)
	(= (slew_time GroundStation3 GroundStation2) 41.91)
	(= (slew_time GroundStation2 GroundStation3) 41.91)
	(= (slew_time Phenomenon5 Star0) 27.13)
	(= (slew_time Star0 Phenomenon5) 27.13)
	(= (slew_time Phenomenon5 GroundStation1) 11.97)
	(= (slew_time GroundStation1 Phenomenon5) 11.97)
	(= (slew_time Phenomenon5 GroundStation2) 53.12)
	(= (slew_time GroundStation2 Phenomenon5) 53.12)
	(= (slew_time Phenomenon5 GroundStation3) 73.48)
	(= (slew_time GroundStation3 Phenomenon5) 73.48)
	(= (slew_time Phenomenon5 GroundStation4) 0.9414)
	(= (slew_time GroundStation4 Phenomenon5) 0.9414)
	(= (slew_time Phenomenon6 Star0) 6.356)
	(= (slew_time Star0 Phenomenon6) 6.356)
	(= (slew_time Phenomenon6 GroundStation1) 4.419)
	(= (slew_time GroundStation1 Phenomenon6) 4.419)
	(= (slew_time Phenomenon6 GroundStation2) 22.96)
	(= (slew_time GroundStation2 Phenomenon6) 22.96)
	(= (slew_time Phenomenon6 GroundStation3) 76.06)
	(= (slew_time GroundStation3 Phenomenon6) 76.06)
	(= (slew_time Phenomenon6 GroundStation4) 42.26)
	(= (slew_time GroundStation4 Phenomenon6) 42.26)
	(= (slew_time Phenomenon6 Phenomenon5) 7.26)
	(= (slew_time Phenomenon5 Phenomenon6) 7.26)
	(= (slew_time Star7 Star0) 14.88)
	(= (slew_time Star0 Star7) 14.88)
	(= (slew_time Star7 GroundStation1) 40.07)
	(= (slew_time GroundStation1 Star7) 40.07)
	(= (slew_time Star7 GroundStation2) 18.79)
	(= (slew_time GroundStation2 Star7) 18.79)
	(= (slew_time Star7 GroundStation3) 73.05)
	(= (slew_time GroundStation3 Star7) 73.05)
	(= (slew_time Star7 GroundStation4) 65.51)
	(= (slew_time GroundStation4 Star7) 65.51)
	(= (slew_time Star7 Phenomenon5) 13.15)
	(= (slew_time Phenomenon5 Star7) 13.15)
	(= (slew_time Star7 Phenomenon6) 15.24)
	(= (slew_time Phenomenon6 Star7) 15.24)
	(= (slew_time Star8 Star0) 15.21)
	(= (slew_time Star0 Star8) 15.21)
	(= (slew_time Star8 GroundStation1) 38.16)
	(= (slew_time GroundStation1 Star8) 38.16)
	(= (slew_time Star8 GroundStation2) 88.5)
	(= (slew_time GroundStation2 Star8) 88.5)
	(= (slew_time Star8 GroundStation3) 48.58)
	(= (slew_time GroundStation3 Star8) 48.58)
	(= (slew_time Star8 GroundStation4) 31.19)
	(= (slew_time GroundStation4 Star8) 31.19)
	(= (slew_time Star8 Phenomenon5) 57.74)
	(= (slew_time Phenomenon5 Star8) 57.74)
	(= (slew_time Star8 Phenomenon6) 46.57)
	(= (slew_time Phenomenon6 Star8) 46.57)
	(= (slew_time Star8 Star7) 81.18)
	(= (slew_time Star7 Star8) 81.18)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite1 GroundStation3)
	(have_image Phenomenon5 image3)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 infrared1)
	(have_image Star8 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation3)
   changed: (fuel satellite1) from 107 to 52.38, (fuel-used) from 0 to 54.62
   goals met: 1 of 6
2. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 172 to 156.79, (fuel-used) from 54.62 to 69.83
   goals met: 1 of 6
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
4. (turn_to satellite0 groundstation1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 156.79 to 133.23, (fuel-used) from 69.83 to 93.39
   goals met: 1 of 6
5. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 133.23 to 121.26, (fuel-used) from 93.39 to 105.36
   goals met: 1 of 6
7. (take_image satellite0 phenomenon5 instrument1 image3)
   added: (have_image phenomenon5 image3)
   changed: (data_capacity satellite0) from 1000 to 727, (data-stored) from 0 to 273
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 121.26 to 114, (fuel-used) from 105.36 to 112.62
   goals met: 2 of 6
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 6
10. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 6
11. (turn_to satellite0 groundstation2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 114 to 91.04, (fuel-used) from 112.62 to 135.58
   goals met: 2 of 6
12. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 2 of 6
13. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 91.04 to 68.08, (fuel-used) from 135.58 to 158.54
   goals met: 2 of 6
14. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 68.08 to 61.724, (fuel-used) from 158.54 to 164.896
   goals met: 2 of 6
15. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 61.724 to 46.514, (fuel-used) from 164.896 to 180.106
   goals met: 2 of 6
16. (take_image satellite0 star8 instrument2 infrared1)
   added: (have_image star8 infrared1)
   changed: (data_capacity satellite0) from 727 to 451, (data-stored) from 273 to 549
   goals met: 3 of 6
17. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 46.514 to 31.304, (fuel-used) from 180.106 to 195.316
   goals met: 3 of 6
18. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 31.304 to 24.948, (fuel-used) from 195.316 to 201.672
   goals met: 3 of 6
19. (take_image satellite0 phenomenon6 instrument2 infrared1)
   added: (have_image phenomenon6 infrared1)
   changed: (data_capacity satellite0) from 451 to 287, (data-stored) from 549 to 713
   goals met: 4 of 6
20. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 24.948 to 9.708, (fuel-used) from 201.672 to 216.912
   goals met: 5 of 6
21. (take_image satellite0 star7 instrument2 infrared1)
   added: (have_image star7 infrared1)
   changed: (data_capacity satellite0) from 287 to 170, (data-stored) from 713 to 830
   goals met: 6 of 6
